### 05 Membalik Urutan Kolom dan Baris pada Pandas Data Frame

In [1]:
import pandas as pd
import numpy as np

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
columns=cols)

df

   A  B  C  D  E
0  6  6  5  4  2
1  4  7  9  3  7
2  2  6  1  4  9
3  5  3  2  2  7
4  6  1  1  1  2

##### Membalikan Urutan kolom

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  2  4  5  6  6
1  7  3  9  7  4
2  9  4  1  6  2
3  7  2  2  3  5
4  2  1  1  1  6

##### Membalikan Urutan Baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  6  1  1  1  2
3  5  3  2  2  7
2  2  6  1  4  9
1  4  7  9  3  7
0  6  6  5  4  2

##### Membali urutan baris dan melakukan penyesuaian ulang index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  6  1  1  1  2
1  5  3  2  2  7
2  2  6  1  4  9
3  4  7  9  3  7
4  6  6  5  4  2

### 06 Mengganti Nama kolom pada Pandas Data Frame

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
columns=cols)

df

   A  B  C  D  E
0  4  1  5  2  3
1  5  6  6  8  6
2  8  7  6  6  9
3  7  1  1  7  9
4  5  6  3  5  5

##### Mengganti nama (label) sebuah kolom dalam Pandas DataFrame

In [7]:
df.rename(columns={'C': 'Hobi'})

   A  B  Hobi  D  E
0  4  1     5  2  3
1  5  6     6  8  6
2  8  7     6  6  9
3  7  1     1  7  9
4  5  6     3  5  5

##### Mengganti nama (label) banyak  kolom dalam Pandas DataFrame

In [8]:
df.rename(columns={'A': 'Nama', 'B': 'Alamat', 'D': 'Kota'})

   Nama  Alamat  C  Kota  E
0     4       1  5     2  3
1     5       6  6     8  6
2     8       7  6     6  9
3     7       1  1     7  9
4     5       6  3     5  5

### 07 Menghapus Missing Values pada Pandas Data Frame

In [9]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [6, 7, 8, 9, 10],
    'C': [None, 11, None, 13, 14]
}).reset_index()
df.head()

   index  A   B     C
0      0  1   6   NaN
1      1  2   7  11.0
2      2  3   8   NaN
3      3  4   9  13.0
4      4  5  10  14.0

In [10]:
df = df.rename(columns={'index': 'Z'})
df.head()

   Z  A   B     C
0  0  1   6   NaN
1  1  2   7  11.0
2  2  3   8   NaN
3  3  4   9  13.0
4  4  5  10  14.0

In [11]:

df_backup = df.copy(deep=True)

##### Menghapus (drop) setiap kolom dari DataFrame df yang mengandung  nilai yang hilang (NaN)

In [12]:
df = df.dropna(axis='columns')
df.head()

   Z  A   B
0  0  1   6
1  1  2   7
2  2  3   8
3  3  4   9
4  4  5  10

##### Menghapus (drop) setiap baris dari DataFrame df yang mengandung  nilai yang hilang (NaN)

In [13]:
df_backup = df.copy(deep=True)
df = df_backup.dropna(axis='rows')
df.head()

   Z  A   B
0  0  1   6
1  1  2   7
2  2  3   8
3  3  4   9
4  4  5  10

##### Menghitung persentase missing values (nilai yang hilang/NaN) untuk setiap kolom dalam DataFrame

In [14]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.0
A    0.0
B    0.0
dtype: float64


##### Menghapus untuk setiap kolom yang mengandung misising values berdasarkan thereshold

In [15]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z  A   B
0  0  1   6
1  1  2   7
2  2  3   8
3  3  4   9
4  4  5  10

### 08 Memeriksa Kesamaan antar Kolom pada Pandas Data frame

In [16]:
data = {
    'A': [15, 15, 18, np.nan, 12],
    'B': [15, 15, 18, np.nan, 12],
}
df= pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [17]:
##### Mengenal Pandas Series

In [18]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [19]:
type(df['A'])

pandas.core.series.Series

In [20]:
type(df)

pandas.core.frame.DataFrame

##### Memeriksa Kesamaan dengan operator ==

In [21]:
df['A']==df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

##### Memeriksa Kesamaan dengan method equals

In [22]:
df['A'].equals (df['B'])

True

##### Memeriksa Kesamaan antar dua Data Frame

In [23]:
df1 = df.copy(deep=True)
df.equals(df1)

True

In [24]:
df== df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True